// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).


// let time = prompt('введіть від 0 до 59')
// if (time <= 15) {
//     alert(1)
// } else if (time <= 30) {
//     alert(2)
// } else if (time <= 45) {
//     alert(3)
// } else {
//     alert(4)
// }
//
//
// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

// let day = prompt('enter day')
// if (day >=0 && day <=10){
//     alert(1)
// }else   if (day =>11 && day <=20){
//     alert(2)
// }else{
//     alert(3)
// }
//
// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

// let test=prompt('enter bool')
// if (test === true){
//     alert('yes')
// }else {
//     alert('no')
// }

// let test=prompt('enter bool') ? alert('yes') : alert('no')
//
//
// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3


// let a = +prompt('enter number 1,0,-3');
//
// (a !== 0) ? alert('yes') : alert('no');


//
// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.
//
// let wiks = prompt('enter day')
// switch (wiks){
//     case'monday':
//         alert('срав пес')
//         break;
//     case 'tuesday':
//         alert('на овес')
//         break;
//     case 'wensday':
//         alert('dsaf')
//         break;
//     default:
//         alert('здох пес')
// }
//
// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.

// let year = prompt('введіть число')
// if (year % 4===0){
//     alert('yes')
// }else {
//     alert('no')
// }
//
// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

// let xxx = prompt('Яка «офіційна» назва JavaScript?')
// if (xxx === 'ECMAScript' ){
//     alert('YES')
// }else{
//     alert('Не знаєте? ECMAScript!')
// }




const myModal =$.modal()

