//- Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
//  кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//  Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]
// if (friends.length>=3) {
//     document.write('це великий масив, в якому  3 і більше елементи.')
// } else {
//     document.write('це маленький масив, в якому менше 3-х елементів.')
// }

// friends.length>=3 ? document.write('це великий масив, в якому  3 і більше елементи.') : document.write('це маленький масив, в якому менше 3-х елементів.')

//- Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//  Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

// let numbers=prompt('Введіть будь яке число')
// if (numbers >=0 && numbers <=1){
//     console.log('переше число')
// }else if (numbers >=1 && numbers <=2){
//     console.log('те що по середині')
// }else if (numbers >=2 && numbers <=3){
//     console.log('те що по останнє')
// }else {
//     console.log('хз що за число')
// }


// - Перепишіть конструкцію if з використанням умовного оператора '?':
//  let result
// const a = 2
// const b = 3
//
//  // if (a + b < 4) {
//  //    result = 'Мало';
//  // } else {
//  //    result = 'Багато';
//  // }
//
// result = (a + b < 4) ? 'Мало' : 'Багато'
// console.log(result)



//- Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

// const number = 0
// console.log(number>=-100 && number <0 ? 'негативне' : number >0 && number <=100 ? 'позитивним' : 'нуль')




