//- Користувач вводить або має два числа.
//    Потрібно знайти та вивести максимальне число з тих двох .
//    Також потрібно врахувати коли введені рівні числа.

// let numbers1 = +prompt('введіть 1  число')
// let numbers2 = +prompt('введіть 2  число')
// if (numbers1 > numbers2) {
//     console.log('1 число більше за 2')
// }
// if (numbers2 > numbers1) {
//     console.log('2 число більше за 1')
// } else if (numbers1 === numbers2) {
//     console.log('числа рівні')
// }


// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
// Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.


// let xxx = +prompt('Введіть номер квартири')
//
// if (xxx >= 1 && xxx <= 20) {
//     console.log('1 підїзд')
// }
// if (xxx >= 21 && xxx <= 48) {
//     console.log('2 підїзд')
// }
// if (xxx >= 49 && xxx <= 90) {
//     console.log('3 підїзд')
// }


//- Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

// let numbers =+prompt('Введіть число')
// if (numbers===10){
//     console.log('YES')
// }else {
//     console.log('NO')
// }

//- Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
// якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else


// let x = ''
// if (typeof x === 'number') {
//     console.log(1)
// } else if (typeof x === 'string') {
//     console.log(2)
// } else if (typeof x === 'boolean') {
//     console.log(3)
// } else {
//     console.log('No')
// }

//- Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
// Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
// Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

//
// let xxx = +prompt('Введіть свою температуру тіла')
// if (xxx >= 10 && xxx <= 20) {
//     console.log('ми йдемо ВЧИТИСЯ')
// } else {
//     console.log('сидимо вдома і вчимося ОНЛАЙН')
// }

// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
// числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

// let game = +prompt('Введіть число від 1 до 5')
// switch (game) {
//     case 1 :
//         console.log('Phone')
//         break
//     case 2 :
//         console.log('Car')
//         break
//     case 3 :
//         console.log('Bus')
//         break
//     case 4 :
//         console.log('Laptop')
//         break
//     case 5 :
//         console.log('PC')
//         break
//     default:
//         console.log('число не вірне')
// }



