// - Дано змінну time яка рівна числу від 0 до 59.
// Потрібно написати код, який перевірить, до якої четверті години попадає число
//(в першу, другу, третю или четверту частину години).

// let time = prompt('Введіть число від 0 до 59')
// if (time >=0 && time <=14.75){
//     console.log(1)
// }else if (time >=14.75 && time <=29.5 ){
//     console.log(2)
// }else if (time >=29.5 && time <=44.25 ){
//     console.log(3)
// }else if (time >=44.25 && time <=59 ){
//     console.log(4)
// }else{
//     console.log('Не дійсне число')
// }

//- У змінній day дано якесь число від 1 до 31.
// Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

// let day = prompt('Введіть число від 1 до 31')
// if (day >= 0 && day <= 10) {
//     console.log(1)
// }
// else if (day >= 11 && day <= 20) {
//     console.log(2)
// }
// else if (day >= 21 && day <= 31) {
//     console.log(3)
// }else{
//     console.log('Число не потрапило')
// }

//- У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
// Перевірте роботу скрипта при test, що дорівнює true, false.
// Напишіть два варіанти скрипта - з коротким записом(тернаркою)

// let test = true
// if (test === true){
//     console.log('Вірно')
// }else {
//     console.log('Невірно')
// }

// test ? console.log('Вірно ') : console.log('Невірно')


//- Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'.
// Перевірте  скрипт при a, що дорівнює 1, 0, -3

// let a = 'hi'
// if (a !== 0){
//     console.log('Вірно')
// }else{
//     console.log('Невірно')
// }

// let a = +prompt('Введіть 1, -3 або 0')
// if (a !== 0){
//     console.log('Вірно')
// }else {
//     console.log('Невірно')
// }
//     a !== 0 ? console.log('Вірно') : console.log('Невірно')

//- Скласти розклад на тиждень за домопоги switch.
// Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.


// let dayw = +prompt('Введіть день тижня')
// switch (dayw) {
//     case 1:
//         console.log('Понеділок :Не піти на роботу')
//         break
//     case 2:
//         console.log('Вівторок :Спати до обіду')
//         break
//     case 3:
//         console.log('Середа : Спати до вечора')
//         break
//     case 4:
//         console.log('Четвер : Поїсти')
//         break
//     case 5:
//         console.log('Пятниця : Попити')
//         break
//     case 6:
//         console.log('Субота : Відпочивати')
//         break
//     case 7:
//         console.log('Неділя : Працювати')
//         break
//     default:
//         console.log('хз що за день')
//
// }


//- Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.

// let year = prompt('Введіть число')
//
// if (year % 4 === 0){
//     console.log('Високосний')
// }else {
//     console.log('Невисокосний')
// }

// (prompt('Введіть число') % 4===0) ? console.log('Високосний'):console.log('Невисокосний')


//- Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!


// let xxx = prompt('Яка «офіційна» назва JavaScript?')
// if (xxx === 'ECMAScript') {
//     console.log('Правильно')
// } else {
//     console.log('Не знаєте? ECMAScript!')
// }
